풀 리퀘스트 병합 #40
fix/image-sequence-transaction
